---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AlignmentStationLabel Properties
AlignmentStationLabel Class See Also Send Feedback
---

The AlignmentStationLabel type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | AlignmentId | The ElementId of the Alignment on which the SpotDimension is placed. |
|  | Element | The underlying SpotDimension element. |
|  | Station | The alignment station at which the SpotDimension is placed. |

# See Also

AlignmentStationLabel Class

Autodesk.Revit.DB.Infrastructure Namespace